/* REXX to space jobs one minute apart */
/*
   This routine takes one parameter, the name of the job AFTER which
   the job running THIS exec must wait a minute before running.

   e.g. The previous job (not necessarily DIRECTLY prior) is JOB12
        This job is JOB15 (which doesn't really matter)
*/
arg prevJob
address TSO
"alloc fi(eggtimer) da('user01.user.eggtimer') old"
"execio * diskR eggtimer (stem in. finis)"
"free fi(eggtimer)"
do i = 1 to in.0
 parse var in.i jobName jobStartTimeStamp . /* YyyyMmDdHmMmSs */
 if jobName = prevJob then
  do
  end
end
exit
