)ATTR
   $ area(dynamic) scroll(on) extend(on)
 % type(output)  color(yellow)
01 type(dataout) color(white)
02 type(dataout) color(yellow)
03 type(dataout) color(turquoise)
04 type(dataout) color(green)
05 type(dataout) color(red)
 ! type(text)    color(white)
 @ type(text)    color(yellow)
 \ type(text)    color(turquoise)
 { type(text)    color(green)
 } type(text)    color(red)

)BODY
+Jobname%jobname   %line#+of%lines!Stepname@Retained\Cataloged/Kept{New}Deleted
+Command ===>_zcmd
$dynvar                                                                        $
)INIT
)PROC
 &pfkey = .PFKEY
)END
