)ATTR
* AREA(DYNAMIC) EXTEND(ON)
@ TYPE(CHAR) HILITE(REVERSE) COLOR(PINK)
0 TYPE(CHAR) HILITE(BLINK) COLOR(YELLOW)
> TYPE(CHAR) COLOR(RED)
\ TYPE(CHAR) COLOR(RED)
/ TYPE(CHAR) COLOR(RED)
, TYPE(CHAR) COLOR(YELLOW)
( TYPE(CHAR) COLOR(YELLOW)
) TYPE(CHAR) COLOR(YELLOW)
| TYPE(CHAR) COLOR(YELLOW)
= TYPE(CHAR) COLOR(YELLOW)
_ TYPE(CHAR) COLOR(YELLOW)
- TYPE(CHAR) COLOR(YELLOW)
< TYPE(CHAR) COLOR(GREEN)
# TYPE(CHAR) COLOR(BLUE)
Á TYPE(DATAOUT) INTENS(LOW) COLOR(white)
)BODY
*DYNVAR,SHADOW                                                                 *
)END
