)ATTR DEFAULT(%+_) /* high text, low text, input */
% TYPE(TEXT) INTENS(HIGH)
+ TYPE(TEXT) INTENS(LOW)
_ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT)
$ TYPE(OUTPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT)
)BODY EXPAND(@@)
+@-@ &PROJNAME @-@
%COMMAND ===>_ZCMD

+ID: +NAME:
+---------- +-----------------------------------
)MODEL
$ID $NAME
)INIT

/* APPLICATION LEVEL */
&PROJNAME = 'SVCSTEST'
&XEND = PFK(END)
&XHLP = PFK(HELP)
/* PANEL LEVEL */
&VALIDS = '1 X'
)REINIT
)PROC
)END
