//BACKUP JOB (BKUP),'Backup full volumes',REGION=0M
)DOT DASD
//DUMPSTEP EXEC  PGM=ADRDSSU
//SYSPRINT DD    SYSOUT=*
//DASD     DD    UNIT=SYSDA,VOL=SER=(&VOLSER),DISP=OLD
//TAPE     DD    UNIT=580,LABEL=(1,SL),
//  DISP=(NEW,KEEP),DSN=USER01.USER.BACKUP.&VOLSER
//SYSIN    DD    *
  DUMP FULL INDDNAME(DASD) OUTDDNAME(TAPE) -
            COMPRESS CONCURRENT
/*
)ENDDOT
