//COPYDSNS JOB COND-(0,NE)
)DOT DATASETS
//*---------------------------------------
//PREPARE  EXEC PGM=IDCAMS
//SYSIN    DD *
 DELETE '&TARGET'
 SET MAXCC = 0
//SYSPRINT DD SYSOUT=*
//*---------------------------------------
//COPYONE  EXEC PGM=IEBGENER
//SYSUT1   DD DISP=SHR,DSN=&SOURCE
//SYSUT2   DD DISP=(NEW,CATLG),DSN=&TARGET,
//  SPACE=(CYL,(500,100),RLSE)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
)ENDDOT
